[{"data":1,"prerenderedAt":557},["Reactive",2],{"news":3},[4,247,384],{"_path":5,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"title":9,"description":10,"author":11,"lastUpdated":12,"created":12,"image":13,"published":15,"featured":15,"head":16,"body":27,"_type":242,"_id":243,"_source":244,"_file":245,"_extension":246},"/news/roadmap-2024","news",false,"","Effect AI: Plans for 2024","Today, we're thrilled to unveil the plans that Effect AI has in store for 2024.","Jesse","2024-03-15",{"src":14},"/img/news/roadmap2024.webp",true,{"meta":17},[18,21,24],{"name":19,"content":20},"keywords","AI, EFX, Roadmap, 2024, Artificial Intelligence, Bridge, Solana",{"name":22,"content":23},"author","Jesse - Effect.AI",{"name":25,"content":26},"copyright","© 2024 Effect.AI",{"type":28,"children":29,"toc":237},"root",[30,38,62,67,74,87,100,106,111,146,151,157,162,167,173,178,196,201,207,212,217,224],{"type":31,"tag":32,"props":33,"children":34},"element","p",{},[35],{"type":36,"value":37},"text","Today, we're thrilled to bring forward the plans that Effect AI has in store for 2024. This year is bound to be a transformative one for Effect AI, as some of the most exciting and groundbreaking updates to the network in years are close on the horizon.",{"type":31,"tag":32,"props":39,"children":40},{},[41,43,52,54,60],{"type":36,"value":42},"Let's dive right in. We will start by taking a look at the rebrand that was ",{"type":31,"tag":44,"props":45,"children":49},"a",{"href":46,"rel":47},"https://dao.effect.network/proposals/149",[48],"nofollow",[50],{"type":36,"value":51},"initiated by the DAO",{"type":36,"value":53}," and has already been put in the works, as is evident from the website you are reading from right now. Then we will cover the most anticipated update: the arrival of Effect AI's new platform. In a couple of weeks, our workforce will be able to pre-register for the long-awaited ",{"type":31,"tag":55,"props":56,"children":57},"strong",{},[58],{"type":36,"value":59},"V2 release",{"type":36,"value":61},", which embodies a significant iteration on every element of the platform. We will also go over the prospects of a migration to the Solana ecosystem. In the midst of all these transformative changes, our DAO takes center stage as a vital force in maintaining and nurturing our ecosystem. The DAO's role will continue to evolve, and we will discuss some major updates regarding it.",{"type":31,"tag":32,"props":63,"children":64},{},[65],{"type":36,"value":66},"Looking ahead, we're excited to launch a series of ambitious long-term growth initiatives that will propel Effect AI to new heights. Stay tuned for an exciting journey ahead as we chart the course for Effect AI's evolution in 2024.",{"type":31,"tag":68,"props":69,"children":71},"h4",{"id":70},"new-website-rebrand",[72],{"type":36,"value":73},"New Website & Rebrand",{"type":31,"tag":32,"props":75,"children":76},{},[77,79,85],{"type":36,"value":78},"The decision to revert to our original identity, \"Effect AI,\" was driven by ",{"type":31,"tag":44,"props":80,"children":82},{"href":46,"rel":81},[48],[83],{"type":36,"value":84},"Proposal #149",{"type":36,"value":86}," from the DAO. This shift allows us to provide clear messaging towards our target audience with a strong focus on the AI industry. It also represents a recommitment to our foundational values around decentralizing artificial intelligence.",{"type":31,"tag":32,"props":88,"children":89},{},[90,92,98],{"type":36,"value":91},"Jeffrey has been hard at work revamping the website, giving it much needed love and attention. The goal is to position the website as the ",{"type":31,"tag":93,"props":94,"children":95},"i",{},[96],{"type":36,"value":97},"go-to hub",{"type":36,"value":99}," for all things related to news, tutorials, documentation, and an anchor for those eager to become part of our dynamic ecosystem. A lot more updates will come out on this, so stay tuned!",{"type":31,"tag":68,"props":101,"children":103},{"id":102},"v2-release",[104],{"type":36,"value":105},"V2 Release",{"type":31,"tag":32,"props":107,"children":108},{},[109],{"type":36,"value":110},"The highly anticipated V2 release is in the final stages of preparation, and will completely revamp the experience of both developers and users. Among the key elements that V2 will introduce are:",{"type":31,"tag":112,"props":113,"children":114},"ul",{},[115,121,126,131,136,141],{"type":31,"tag":116,"props":117,"children":118},"li",{},[119],{"type":36,"value":120},"Python SDK for convenient publishing and retrieval of datasets",{"type":31,"tag":116,"props":122,"children":123},{},[124],{"type":36,"value":125},"Integrations with ML frameworks",{"type":31,"tag":116,"props":127,"children":128},{},[129],{"type":36,"value":130},"Typescript Worker SDK",{"type":31,"tag":116,"props":132,"children":133},{},[134],{"type":36,"value":135},"New smart-contract architecture that will facilitate thousands of concurrent annotations",{"type":31,"tag":116,"props":137,"children":138},{},[139],{"type":36,"value":140},"Support for large and encrypted datasets",{"type":31,"tag":116,"props":142,"children":143},{},[144],{"type":36,"value":145},"New and performant UIs for data annotation",{"type":31,"tag":32,"props":147,"children":148},{},[149],{"type":36,"value":150},"With the V2 release we are doubling down on our commitment to developers, aiming to streamline their journey on the platform. Expect significant DX updates to our SDK, enabling developers to harness the power of our workforce with just three to five lines of code. The V2 release will see a slow roll out over the coming weeks, with an early access registration opening soon.",{"type":31,"tag":68,"props":152,"children":154},{"id":153},"solana-bridge",[155],{"type":36,"value":156},"Solana Bridge",{"type":31,"tag":32,"props":158,"children":159},{},[160],{"type":36,"value":161},"As many of you may have noticed, the community is discussing the exciting opportunity to integrate with the Solana ecosystem. Solana has quickly emerged as a thriving hub for both DePIN and AI projects, making it an ideal choice for Effect AI's expansion. The Effect AI team has experience and strong connections within the Solana ecosystem, which opens up a world of possibilities for strategic partnerships and collaborations with like-minded projects, and helps us push the boundaries of decentralized and transparent AI.",{"type":31,"tag":32,"props":163,"children":164},{},[165],{"type":36,"value":166},"Following the V2 release, a working group will be established to focus on the bridge that enables EFX token utilities on Solana. This bridge will pave the way for the migration of many utilities to the Solana ecosystem over time. The details of this migration path will soon be published in a DAO proposal for discussion and refinement, and we are more than excited to hear your input.",{"type":31,"tag":68,"props":168,"children":170},{"id":169},"major-dao-protocol-updates",[171],{"type":36,"value":172},"Major DAO & Protocol Updates",{"type":31,"tag":32,"props":174,"children":175},{},[176],{"type":36,"value":177},"Next to the roll out of the V2 network, there will be a focus on the DAO's evolution. The DAO has been increasingly engaged when it comes to the development and operation of the network. At this point, ATPs have matured and community members will be able to contribute on core protocol upgrades. To formalize this, we will introduce the concept of Working Groups around specific topics of interest:",{"type":31,"tag":112,"props":179,"children":180},{},[181,186,191],{"type":31,"tag":116,"props":182,"children":183},{},[184],{"type":36,"value":185},"Improved staking & rewards system",{"type":31,"tag":116,"props":187,"children":188},{},[189],{"type":36,"value":190},"Stabilizing rewards with a G-EFX system",{"type":31,"tag":116,"props":192,"children":193},{},[194],{"type":36,"value":195},"Marketing and partnerships",{"type":31,"tag":32,"props":197,"children":198},{},[199],{"type":36,"value":200},"These working groups aim to streamline operations and better serve the EFX community.",{"type":31,"tag":68,"props":202,"children":204},{"id":203},"mobile-app",[205],{"type":36,"value":206},"Mobile app",{"type":31,"tag":32,"props":208,"children":209},{},[210],{"type":36,"value":211},"This has been on the agenda for a long time, but the wait is almost over. Once V2 is running seamlessly, Effect will finally be able to provide a work-from-anywhere experience with the development of a mobile app.",{"type":31,"tag":32,"props":213,"children":214},{},[215],{"type":36,"value":216},"Imagine the convenience of completing simple tasks and training AI models from anywhere, at any time. With the mobile app, this vision becomes a reality. Being on your morning commute or taking a break at the park, you'll have the power to contribute to the ecosystem and earn on the go.",{"type":31,"tag":218,"props":219,"children":221},"h3",{"id":220},"join-us",[222],{"type":36,"value":223},"Join us!",{"type":31,"tag":32,"props":225,"children":226},{},[227,229,235],{"type":36,"value":228},"We hope you are excited for all the milestones that are lined up over the coming months. If you would like to join our efforts in building the largest data network for AI-training, we recommend that you ",{"type":31,"tag":44,"props":230,"children":232},{"href":231},"dao.effect.network",[233],{"type":36,"value":234},"join our DAO",{"type":36,"value":236},", and follow us on socials to get alerted when the V2 registrations open.",{"title":8,"searchDepth":238,"depth":238,"links":239},2,[240],{"id":220,"depth":241,"text":223},3,"markdown","content:news:roadmap-2024.md","content","news/roadmap-2024.md","md",{"_path":248,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"title":249,"description":250,"author":11,"lastUpdated":251,"created":251,"image":252,"published":15,"body":254,"_type":242,"_id":382,"_source":244,"_file":383,"_extension":246},"/news/on-chain-microtasks","Tech Blog: On-Chain Microtasks","In this article, we’ll take a look at Effect Force’s new task creation mechanism. This technology makes it simple for people and businesses to add microtasks to the blockchain.","2024-03-09",{"src":253},"/img/news/on-chain-microtasks.webp",{"type":28,"children":255,"toc":375},[256,260,265,270,275,282,287,292,297,303,308,313,318,322,328,333,338,344,349,354,359,365,370],{"type":31,"tag":32,"props":257,"children":258},{},[259],{"type":36,"value":250},{"type":31,"tag":32,"props":261,"children":262},{},[263],{"type":36,"value":264},"This is the second of a three-part technical blog series. The first, regarding the Effect account system, is available here.",{"type":31,"tag":32,"props":266,"children":267},{},[268],{"type":36,"value":269},"Tasks are the lifeblood of microtasking platforms like Effect Force. When it is straightforward to add jobs, more companies will be drawn to the platform, the workforce will receive more incentives, and the network will collect more fees, inspiring more people to work on developing the system.",{"type":31,"tag":32,"props":271,"children":272},{},[273],{"type":36,"value":274},"Our new system decentralizes task creation, allowing anyone to post tasks without being registered or pre-approved. This update will make the Effect Network more accessible to a wide range of communities, while also increasing its scalability. The onboarding no longer relies on a single company.",{"type":31,"tag":276,"props":277,"children":279},"h2",{"id":278},"new-architecture",[280],{"type":36,"value":281},"New architecture",{"type":31,"tag":32,"props":283,"children":284},{},[285],{"type":36,"value":286},"Effect Force’s mission is to deliver high-quality annotated datasets. Requesters (clients) can submit their dataset to the platform along with an EFX payment and receive an annotated dataset in exchange.",{"type":31,"tag":32,"props":288,"children":289},{},[290],{"type":36,"value":291},"Tasks and submissions are the two most essential components of Effect Force. A task is a single datapoint that a requester adds. A submission is a single annotation made by a worker. When initiating a task, requesters must place the needed EFX in escrow to ensure payment to workers. Additionally, workers must have relevant qualifications before starting to work on a task.",{"type":31,"tag":293,"props":294,"children":296},"img",{"alt":8,"src":295},"https://miro.medium.com/v2/resize:fit:720/format:webp/0*L5h3pmMuuVv_xzXN",[],{"type":31,"tag":276,"props":298,"children":300},{"id":299},"the-task-merkle-tree",[301],{"type":36,"value":302},"The Task Merkle Tree",{"type":31,"tag":32,"props":304,"children":305},{},[306],{"type":36,"value":307},"Effect Force uses a merkle tree to represent tasks in order to efficiently support large datasets from requesters. Merkle trees are a popular data structure in blockchain technology because they allow smart contracts to validate that a data point is part of a dataset by using a single hash (the merkle root) and a light proof (the merkle proof).",{"type":31,"tag":32,"props":309,"children":310},{},[311],{"type":36,"value":312},"When requesters upload a dataset to Effect Force, they simply have to provide the merkle root to the blockchain. The actual task data can be sent via a separate media, such as IPFS. Effect Force will offer a variety of data distribution methods and will also be able to support private datasets. As a result, blockchain resources required to upload a dataset will remain minimal.",{"type":31,"tag":32,"props":314,"children":315},{},[316],{"type":36,"value":317},"To submit an annotation to the blockchain, a worker must provide the task data hash (e.g. H1) to the smart contract, along with the merkle proof proving that it is part of the dataset.",{"type":31,"tag":293,"props":319,"children":321},{"alt":8,"src":320},"https://miro.medium.com/v2/resize:fit:720/format:webp/0*KN7ukC8BGj7pcwKF",[],{"type":31,"tag":276,"props":323,"children":325},{"id":324},"qualifications",[326],{"type":36,"value":327},"Qualifications",{"type":31,"tag":32,"props":329,"children":330},{},[331],{"type":36,"value":332},"Microtasks, like any other task, need capable people to complete them. You must have access to qualified individuals in order to get the greatest quality results. Tasks may need the use of a single ability or a combination of skills. For example, in order to receive high-quality translations from English into Chinese, you must find people who are fluent in both languages.",{"type":31,"tag":32,"props":334,"children":335},{},[336],{"type":36,"value":337},"Effect Force already offers numerous ‘basic’ requirements that measure a worker’s ability to label and classify data. These qualifications will now be listed and searchable on the blockchain. Clients can save time in workforce curation by selecting previously qualified workers when they publish their tasks to the platform. Clients can also create and assign their own qualifications, further customizing Effect Force to their specific needs.",{"type":31,"tag":276,"props":339,"children":341},{"id":340},"validation-and-task-quality",[342],{"type":36,"value":343},"Validation and task quality",{"type":31,"tag":32,"props":345,"children":346},{},[347],{"type":36,"value":348},"A worker can collect the EFX reward from the escrow after submitting a task. So, how can we ensure that workers put forth the greatest effort possible? In the past, Effect Force has always been optimistic about payouts, and workers are typically paid immediately. We’ve learned a lot from this model over the last three years, so we’ve chosen to provide an updated version in this update.",{"type":31,"tag":32,"props":350,"children":351},{},[352],{"type":36,"value":353},"Campaigns will no longer offer an instant payment in the future. Instead, payment is sent once a client approves a submission or after a specific deadline has elapsed (by default 3 days). This will allow Effect Force to provide higher-quality data to its clients at the tradeoff of a minor inconvenience for workers. The smart contract will still guarantee the payments, and any rejected tasks will be investigated by a validation team.",{"type":31,"tag":32,"props":355,"children":356},{},[357],{"type":36,"value":358},"Just like tasks and submissions, validations will be registered directly on the blockchain, making them completely transparent.",{"type":31,"tag":276,"props":360,"children":362},{"id":361},"next-up",[363],{"type":36,"value":364},"Next up",{"type":31,"tag":32,"props":366,"children":367},{},[368],{"type":36,"value":369},"This blog post explained some of the techniques that will be employed in the new Effect Force. Luckily for all of us, the majority of this occurs behind the scenes in the SDK, and end-users do not have to worry about it. This update also includes a user-friendly interface and a shiny new API for interacting with the system.",{"type":31,"tag":32,"props":371,"children":372},{},[373],{"type":36,"value":374},"With so many possibilities of what can be completed using Effect Force, what tasks would you upload? Tell us in the comments section. Make sure you are subscribed to our blog, so you don’t miss the third article of this series about how the almighty DAO ties in with the operations of Effect Force.",{"title":8,"searchDepth":238,"depth":238,"links":376},[377,378,379,380,381],{"id":278,"depth":238,"text":281},{"id":299,"depth":238,"text":302},{"id":324,"depth":238,"text":327},{"id":340,"depth":238,"text":343},{"id":361,"depth":238,"text":364},"content:news:on-chain-microtasks.md","news/on-chain-microtasks.md",{"_path":385,"_dir":6,"_draft":7,"_partial":7,"_locale":8,"title":386,"description":387,"image":388,"author":390,"head":391,"lastUpdated":398,"created":398,"published":15,"body":399,"_type":242,"_id":555,"_source":244,"_file":556,"_extension":246},"/news/effect-dao-staking-procotol","The Effect DAO: Effect Staking Protocol 2.0","By staking EFX, holders can improve their rank in The Effect DAO. Achieving a high rank has many benefits like vote casting, fee reward collection, and gaining privileges on the dApp level.",{"src":389},"/img/news/effect-staking.webp","Laurens",{"meta":392},[393,395,397],{"name":19,"content":394},"AI, EFX, deepdive, technology, staking",{"name":22,"content":396},"Laurens - Effect.AI",{"name":25,"content":26},"2024-03-07",{"type":28,"children":400,"toc":546},[401,406,411,417,422,426,431,435,441,446,451,455,461,466,471,476,480,485,490,496,501,505,510,516,521,527,541],{"type":31,"tag":276,"props":402,"children":404},{"id":403},"the-effect-dao-effect-staking-protocol-20",[405],{"type":36,"value":386},{"type":31,"tag":32,"props":407,"children":408},{},[409],{"type":36,"value":410},"By staking EFX, holders can improve their rank in The Effect DAO. Achieving a high rank has many benefits like vote casting, fee reward collection, and gaining privileges on the dApp level. Each rank in the DAO is accompanied by a degree of responsibility in the Network. Users are held accountable for their actions with the risk of losing their stake position, its value, and associated privileges. To summarize, this means staking can be seen as a person’s proof of commitment and it is used as a primary quality measure in the network.",{"type":31,"tag":276,"props":412,"children":414},{"id":413},"dao-ranking",[415],{"type":36,"value":416},"DAO Ranking",{"type":31,"tag":32,"props":418,"children":419},{},[420],{"type":36,"value":421},"The TriForce of EFX and its Stake AGE combined with NFX is the core of the new Staking Protocol 2.0. These three factors will determine your DAO Rank, which in turn determines how many voting allocations (and thus fee rewards) you have at your disposal.",{"type":31,"tag":293,"props":423,"children":425},{"alt":8,"src":424},"https://miro.medium.com/v2/resize:fit:720/format:webp/1*snW5nBTLyQHMWCv1XnCB1w.png",[],{"type":31,"tag":32,"props":427,"children":428},{},[429],{"type":36,"value":430},"Your DAO Rank will be useful for, among other things, proposal writing, vote allocations, fee distributions, etc. The precise DAO-level specifications will be determined in the technical paper, but the graph below demonstrates the high-level understanding of how the DAO level will be influenced by EFX Power and NFX. By using an exponential function to determine the minimum requirement of EFX Power, it will be easier for newcomers with lower rankings to participate in the DAO. It will, however, take longer if you want to participate with higher levels of DAO ranking. As your EFX Power increases over time due to Stake AGE (more on this later), and to keep things fair, there is an exponential increase in requirement for EFX (shown with the red line). Since NFX doesn’t have the feature of Stake AGE, it makes more sense to have a linear function that determines the minimum requirements per level (shown with the blue line):",{"type":31,"tag":293,"props":432,"children":434},{"alt":8,"src":433},"https://miro.medium.com/v2/resize:fit:720/format:webp/0*EjOpPnzcgStRG79X",[],{"type":31,"tag":276,"props":436,"children":438},{"id":437},"efx-power",[439],{"type":36,"value":440},"EFX Power",{"type":31,"tag":32,"props":442,"children":443},{},[444],{"type":36,"value":445},"EFX Power is a factor that determines your weight and rank within the DAO. This measurement is a result of the Staking Protocol 2.0. There are two ways to increase your EFX Staking Power:",{"type":31,"tag":32,"props":447,"children":448},{},[449],{"type":36,"value":450},"Increase the number of staked EFX tokens\nStake your EFX tokens longer to increase their Stake AGE\nThe first one is fairly simple: the more tokens you stake the more EFX Power you will have. This is simply a 1:1 ratio (e.g. 100k staked EFX = 100k EFX Power). This is how most ordinary staking protocols work. However, The Effect Staking Protocol includes a measurement feature to track how long your stake has been active. This feature is called Stake AGE. Below you will find a graph that shows how Stake AGE can affect the EFX Power for a fixed number of staked EFX tokens (100k EFX).",{"type":31,"tag":293,"props":452,"children":454},{"alt":8,"src":453},"https://miro.medium.com/v2/resize:fit:720/format:webp/0*WqSBasfB0M6fHVW2",[],{"type":31,"tag":276,"props":456,"children":458},{"id":457},"stake-age",[459],{"type":36,"value":460},"Stake AGE",{"type":31,"tag":32,"props":462,"children":463},{},[464],{"type":36,"value":465},"Stake AGE is a factor that increases the weight of staked tokens linearly over time; the longer the tokens are staked the more EFX Power they will have.",{"type":31,"tag":32,"props":467,"children":468},{},[469],{"type":36,"value":470},"Stake AGE was first introduced in Effect Staking Protocol 1.0. This section will give a recap of the benefits and power of Stake AGE and also outlines the differences between Staking Protocol 1.0 and Staking Protocol 2.0.",{"type":31,"tag":32,"props":472,"children":473},{},[474],{"type":36,"value":475},"In version 1.0, Stake AGE was a multiplier for the number of NFX tokens that were generated with your staked EFX tokens. The generation of NFX tokens will stop at one point if we switch over to the new version, but staking will continue, as well as Stake AGE. In Staking Protocol 2.0, the existing limit of 200 days Stake AGE will be increased and the role of Stake AGE will become even more important and powerful. With the parameters outlined in the graph from the previous section, it shows that Stake AGE can double your EFX power by adding the initially staked tokens to your EFX power after 200 days of Stake AGE. This means, for example, that someone with 100k staked tokens with a year of Stake AGE has more EFX Power than someone who recently staked 200k EFX. The limit will be set in such a way that early and long-term members will greatly benefit from having staked their tokens longer. Also, it will make the Stake AGE not too powerful, as it still needs to be beneficial to stake more EFX as well. Such a parameter is a great example of something that can be controlled by DAO governance voting proposals.",{"type":31,"tag":293,"props":477,"children":479},{"alt":8,"src":478},"https://miro.medium.com/v2/resize:fit:720/format:webp/0*cnSX-wam1SSSoVa2",[],{"type":31,"tag":32,"props":481,"children":482},{},[483],{"type":36,"value":484},"Stake AGE has several benefits over regular staking:",{"type":31,"tag":32,"props":486,"children":487},{},[488],{"type":36,"value":489},"Users will be incentivized to keep their tokens staked for a longer time.\nEarly and long-term participants are rewarded.\nIt will be harder for new members with a lot of tokens to immediately take big rewards or votes from the DAO.\nThe penalty for unstaking will be bigger as users will lose their Stake AGE for their unstaked tokens, making sure users are incentivized to keep their tokens staked.",{"type":31,"tag":276,"props":491,"children":493},{"id":492},"voting-allocations-and-fee-rewards",[494],{"type":36,"value":495},"Voting Allocations and Fee Rewards",{"type":31,"tag":32,"props":497,"children":498},{},[499],{"type":36,"value":500},"There are four major stages that play an important role in the Effect DAO. The first one is the Staking Protocol, which will determine your DAO Rank. The next stage is to become a DAO Guardian with your DAO Rank by signing the DAO Constitution and participating in the Network. More on DAO Guardians can be found in this blog post. As a DAO Guardian, you can use your DAO Rank to write proposals and cast votes. By participating in the DAO, you’ll earn stakes in the network fee distribution pool which is the last stage of the Effect DAO.",{"type":31,"tag":293,"props":502,"children":504},{"alt":8,"src":503},"https://miro.medium.com/v2/resize:fit:720/format:webp/1*rw_jP8fvKGDm7Mrzeu4u4A.png",[],{"type":31,"tag":32,"props":506,"children":507},{},[508],{"type":36,"value":509},"The number of votes that a Guardian has is determined by the Effect Staking Protocol: a Triforce of EFX and its Stake Age, and more importantly, NFX. These three factors determine your DAO Rank and how many voting allocations you have at your disposal. Participating in either voting or proposing is highly rewarded with fee distributions, which will be discussed in a forthcoming chapter. Tied Voting Allocations will also play a special role in the fee distribution later on. You can read more about the Effect DAO Voting system in this blog post.",{"type":31,"tag":276,"props":511,"children":513},{"id":512},"migration-from-10-to-20",[514],{"type":36,"value":515},"Migration from 1.0 to 2.0",{"type":31,"tag":32,"props":517,"children":518},{},[519],{"type":36,"value":520},"The EFX that you currently have staked combined with your Stake AGE will be carried over to the Staking Protocol 2.0, so there is no reason for unstaking. In addition to the NFX bonus that early adopters have already generated by Staking Protocol 1.0 received, this carryover of Stake AGE is another valuable benefit for early and long-term stakers. Important to note that the generation of NFX will stop at the deployment of Effect Staking Protocol 2.0.",{"type":31,"tag":276,"props":522,"children":524},{"id":523},"more-details-technical-paper",[525],{"type":36,"value":526},"More details: Technical Paper",{"type":31,"tag":32,"props":528,"children":529},{},[530,532,539],{"type":36,"value":531},"While this blog post outlines the high-level inner workings of the new Staking Protocol 2.0, the exact implementation, parameters, and details can be found in the ",{"type":31,"tag":44,"props":533,"children":536},{"href":534,"target":535},"/download/effect_staking_protocol.pdf","_blank",[537],{"type":36,"value":538},"Technical Paper",{"type":36,"value":540}," about the Effect Staking Protocol. This paper covers the mathematical formulas, among other things, for EFX Power with limited Stake AGE, the DAO level requirement formulas, dilution of the Stake AGE when topping up your stake, voting allocations, and more.",{"type":31,"tag":32,"props":542,"children":543},{},[544],{"type":36,"value":545},"Thanks for reading!",{"title":8,"searchDepth":238,"depth":238,"links":547},[548,549,550,551,552,553,554],{"id":403,"depth":238,"text":386},{"id":413,"depth":238,"text":416},{"id":437,"depth":238,"text":440},{"id":457,"depth":238,"text":460},{"id":492,"depth":238,"text":495},{"id":512,"depth":238,"text":515},{"id":523,"depth":238,"text":526},"content:news:effect-dao-staking-procotol.md","news/effect-dao-staking-procotol.md",1710924757479]