[{"data":1,"prerenderedAt":153},["Reactive",2],{"page-data":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"author":10,"lastUpdated":11,"created":11,"image":12,"published":14,"body":15,"_type":148,"_id":149,"_source":150,"_file":151,"_extension":152},"/news/on-chain-microtasks","news",false,"","Tech Blog: On-Chain Microtasks","In this article, we’ll take a look at Effect Force’s new task creation mechanism. This technology makes it simple for people and businesses to add microtasks to the blockchain.","Jesse","2024-03-09",{"src":13},"/img/news/on-chain-microtasks.webp",true,{"type":16,"children":17,"toc":140},"root",[18,25,30,35,40,47,52,57,62,68,73,78,83,87,93,98,103,109,114,119,124,130,135],{"type":19,"tag":20,"props":21,"children":22},"element","p",{},[23],{"type":24,"value":9},"text",{"type":19,"tag":20,"props":26,"children":27},{},[28],{"type":24,"value":29},"This is the second of a three-part technical blog series. The first, regarding the Effect account system, is available here.",{"type":19,"tag":20,"props":31,"children":32},{},[33],{"type":24,"value":34},"Tasks are the lifeblood of microtasking platforms like Effect Force. When it is straightforward to add jobs, more companies will be drawn to the platform, the workforce will receive more incentives, and the network will collect more fees, inspiring more people to work on developing the system.",{"type":19,"tag":20,"props":36,"children":37},{},[38],{"type":24,"value":39},"Our new system decentralizes task creation, allowing anyone to post tasks without being registered or pre-approved. This update will make the Effect Network more accessible to a wide range of communities, while also increasing its scalability. The onboarding no longer relies on a single company.",{"type":19,"tag":41,"props":42,"children":44},"h2",{"id":43},"new-architecture",[45],{"type":24,"value":46},"New architecture",{"type":19,"tag":20,"props":48,"children":49},{},[50],{"type":24,"value":51},"Effect Force’s mission is to deliver high-quality annotated datasets. Requesters (clients) can submit their dataset to the platform along with an EFX payment and receive an annotated dataset in exchange.",{"type":19,"tag":20,"props":53,"children":54},{},[55],{"type":24,"value":56},"Tasks and submissions are the two most essential components of Effect Force. A task is a single datapoint that a requester adds. A submission is a single annotation made by a worker. When initiating a task, requesters must place the needed EFX in escrow to ensure payment to workers. Additionally, workers must have relevant qualifications before starting to work on a task.",{"type":19,"tag":58,"props":59,"children":61},"img",{"alt":7,"src":60},"https://miro.medium.com/v2/resize:fit:720/format:webp/0*L5h3pmMuuVv_xzXN",[],{"type":19,"tag":41,"props":63,"children":65},{"id":64},"the-task-merkle-tree",[66],{"type":24,"value":67},"The Task Merkle Tree",{"type":19,"tag":20,"props":69,"children":70},{},[71],{"type":24,"value":72},"Effect Force uses a merkle tree to represent tasks in order to efficiently support large datasets from requesters. Merkle trees are a popular data structure in blockchain technology because they allow smart contracts to validate that a data point is part of a dataset by using a single hash (the merkle root) and a light proof (the merkle proof).",{"type":19,"tag":20,"props":74,"children":75},{},[76],{"type":24,"value":77},"When requesters upload a dataset to Effect Force, they simply have to provide the merkle root to the blockchain. The actual task data can be sent via a separate media, such as IPFS. Effect Force will offer a variety of data distribution methods and will also be able to support private datasets. As a result, blockchain resources required to upload a dataset will remain minimal.",{"type":19,"tag":20,"props":79,"children":80},{},[81],{"type":24,"value":82},"To submit an annotation to the blockchain, a worker must provide the task data hash (e.g. H1) to the smart contract, along with the merkle proof proving that it is part of the dataset.",{"type":19,"tag":58,"props":84,"children":86},{"alt":7,"src":85},"https://miro.medium.com/v2/resize:fit:720/format:webp/0*KN7ukC8BGj7pcwKF",[],{"type":19,"tag":41,"props":88,"children":90},{"id":89},"qualifications",[91],{"type":24,"value":92},"Qualifications",{"type":19,"tag":20,"props":94,"children":95},{},[96],{"type":24,"value":97},"Microtasks, like any other task, need capable people to complete them. You must have access to qualified individuals in order to get the greatest quality results. Tasks may need the use of a single ability or a combination of skills. For example, in order to receive high-quality translations from English into Chinese, you must find people who are fluent in both languages.",{"type":19,"tag":20,"props":99,"children":100},{},[101],{"type":24,"value":102},"Effect Force already offers numerous ‘basic’ requirements that measure a worker’s ability to label and classify data. These qualifications will now be listed and searchable on the blockchain. Clients can save time in workforce curation by selecting previously qualified workers when they publish their tasks to the platform. Clients can also create and assign their own qualifications, further customizing Effect Force to their specific needs.",{"type":19,"tag":41,"props":104,"children":106},{"id":105},"validation-and-task-quality",[107],{"type":24,"value":108},"Validation and task quality",{"type":19,"tag":20,"props":110,"children":111},{},[112],{"type":24,"value":113},"A worker can collect the EFX reward from the escrow after submitting a task. So, how can we ensure that workers put forth the greatest effort possible? In the past, Effect Force has always been optimistic about payouts, and workers are typically paid immediately. We’ve learned a lot from this model over the last three years, so we’ve chosen to provide an updated version in this update.",{"type":19,"tag":20,"props":115,"children":116},{},[117],{"type":24,"value":118},"Campaigns will no longer offer an instant payment in the future. Instead, payment is sent once a client approves a submission or after a specific deadline has elapsed (by default 3 days). This will allow Effect Force to provide higher-quality data to its clients at the tradeoff of a minor inconvenience for workers. The smart contract will still guarantee the payments, and any rejected tasks will be investigated by a validation team.",{"type":19,"tag":20,"props":120,"children":121},{},[122],{"type":24,"value":123},"Just like tasks and submissions, validations will be registered directly on the blockchain, making them completely transparent.",{"type":19,"tag":41,"props":125,"children":127},{"id":126},"next-up",[128],{"type":24,"value":129},"Next up",{"type":19,"tag":20,"props":131,"children":132},{},[133],{"type":24,"value":134},"This blog post explained some of the techniques that will be employed in the new Effect Force. Luckily for all of us, the majority of this occurs behind the scenes in the SDK, and end-users do not have to worry about it. This update also includes a user-friendly interface and a shiny new API for interacting with the system.",{"type":19,"tag":20,"props":136,"children":137},{},[138],{"type":24,"value":139},"With so many possibilities of what can be completed using Effect Force, what tasks would you upload? Tell us in the comments section. Make sure you are subscribed to our blog, so you don’t miss the third article of this series about how the almighty DAO ties in with the operations of Effect Force.",{"title":7,"searchDepth":141,"depth":141,"links":142},2,[143,144,145,146,147],{"id":43,"depth":141,"text":46},{"id":64,"depth":141,"text":67},{"id":89,"depth":141,"text":92},{"id":105,"depth":141,"text":108},{"id":126,"depth":141,"text":129},"markdown","content:news:on-chain-microtasks.md","content","news/on-chain-microtasks.md","md",1710752397782]