[{"data":1,"prerenderedAt":195},["Reactive",2],{"page-data":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"image":10,"author":12,"head":13,"lastUpdated":24,"created":24,"published":25,"body":26,"_type":190,"_id":191,"_source":192,"_file":193,"_extension":194},"/news/effect-dao-staking-procotol","news",false,"","The Effect DAO: Effect Staking Protocol 2.0","By staking EFX, holders can improve their rank in The Effect DAO. Achieving a high rank has many benefits like vote casting, fee reward collection, and gaining privileges on the dApp level.",{"src":11},"/img/news/effect-staking.webp","Laurens",{"meta":14},[15,18,21],{"name":16,"content":17},"keywords","AI, EFX, deepdive, technology, staking",{"name":19,"content":20},"author","Laurens - Effect.AI",{"name":22,"content":23},"copyright","© 2024 Effect.AI","2024-03-07",true,{"type":27,"children":28,"toc":180},"root",[29,37,43,49,54,59,64,68,74,79,84,88,94,99,104,109,113,118,123,129,134,138,143,149,154,160,175],{"type":30,"tag":31,"props":32,"children":34},"element","h2",{"id":33},"the-effect-dao-effect-staking-protocol-20",[35],{"type":36,"value":8},"text",{"type":30,"tag":38,"props":39,"children":40},"p",{},[41],{"type":36,"value":42},"By staking EFX, holders can improve their rank in The Effect DAO. Achieving a high rank has many benefits like vote casting, fee reward collection, and gaining privileges on the dApp level. Each rank in the DAO is accompanied by a degree of responsibility in the Network. Users are held accountable for their actions with the risk of losing their stake position, its value, and associated privileges. To summarize, this means staking can be seen as a person’s proof of commitment and it is used as a primary quality measure in the network.",{"type":30,"tag":31,"props":44,"children":46},{"id":45},"dao-ranking",[47],{"type":36,"value":48},"DAO Ranking",{"type":30,"tag":38,"props":50,"children":51},{},[52],{"type":36,"value":53},"The TriForce of EFX and its Stake AGE combined with NFX is the core of the new Staking Protocol 2.0. These three factors will determine your DAO Rank, which in turn determines how many voting allocations (and thus fee rewards) you have at your disposal.",{"type":30,"tag":55,"props":56,"children":58},"img",{"alt":7,"src":57},"https://miro.medium.com/v2/resize:fit:720/format:webp/1*snW5nBTLyQHMWCv1XnCB1w.png",[],{"type":30,"tag":38,"props":60,"children":61},{},[62],{"type":36,"value":63},"Your DAO Rank will be useful for, among other things, proposal writing, vote allocations, fee distributions, etc. The precise DAO-level specifications will be determined in the technical paper, but the graph below demonstrates the high-level understanding of how the DAO level will be influenced by EFX Power and NFX. By using an exponential function to determine the minimum requirement of EFX Power, it will be easier for newcomers with lower rankings to participate in the DAO. It will, however, take longer if you want to participate with higher levels of DAO ranking. As your EFX Power increases over time due to Stake AGE (more on this later), and to keep things fair, there is an exponential increase in requirement for EFX (shown with the red line). Since NFX doesn’t have the feature of Stake AGE, it makes more sense to have a linear function that determines the minimum requirements per level (shown with the blue line):",{"type":30,"tag":55,"props":65,"children":67},{"alt":7,"src":66},"https://miro.medium.com/v2/resize:fit:720/format:webp/0*EjOpPnzcgStRG79X",[],{"type":30,"tag":31,"props":69,"children":71},{"id":70},"efx-power",[72],{"type":36,"value":73},"EFX Power",{"type":30,"tag":38,"props":75,"children":76},{},[77],{"type":36,"value":78},"EFX Power is a factor that determines your weight and rank within the DAO. This measurement is a result of the Staking Protocol 2.0. There are two ways to increase your EFX Staking Power:",{"type":30,"tag":38,"props":80,"children":81},{},[82],{"type":36,"value":83},"Increase the number of staked EFX tokens\nStake your EFX tokens longer to increase their Stake AGE\nThe first one is fairly simple: the more tokens you stake the more EFX Power you will have. This is simply a 1:1 ratio (e.g. 100k staked EFX = 100k EFX Power). This is how most ordinary staking protocols work. However, The Effect Staking Protocol includes a measurement feature to track how long your stake has been active. This feature is called Stake AGE. Below you will find a graph that shows how Stake AGE can affect the EFX Power for a fixed number of staked EFX tokens (100k EFX).",{"type":30,"tag":55,"props":85,"children":87},{"alt":7,"src":86},"https://miro.medium.com/v2/resize:fit:720/format:webp/0*WqSBasfB0M6fHVW2",[],{"type":30,"tag":31,"props":89,"children":91},{"id":90},"stake-age",[92],{"type":36,"value":93},"Stake AGE",{"type":30,"tag":38,"props":95,"children":96},{},[97],{"type":36,"value":98},"Stake AGE is a factor that increases the weight of staked tokens linearly over time; the longer the tokens are staked the more EFX Power they will have.",{"type":30,"tag":38,"props":100,"children":101},{},[102],{"type":36,"value":103},"Stake AGE was first introduced in Effect Staking Protocol 1.0. This section will give a recap of the benefits and power of Stake AGE and also outlines the differences between Staking Protocol 1.0 and Staking Protocol 2.0.",{"type":30,"tag":38,"props":105,"children":106},{},[107],{"type":36,"value":108},"In version 1.0, Stake AGE was a multiplier for the number of NFX tokens that were generated with your staked EFX tokens. The generation of NFX tokens will stop at one point if we switch over to the new version, but staking will continue, as well as Stake AGE. In Staking Protocol 2.0, the existing limit of 200 days Stake AGE will be increased and the role of Stake AGE will become even more important and powerful. With the parameters outlined in the graph from the previous section, it shows that Stake AGE can double your EFX power by adding the initially staked tokens to your EFX power after 200 days of Stake AGE. This means, for example, that someone with 100k staked tokens with a year of Stake AGE has more EFX Power than someone who recently staked 200k EFX. The limit will be set in such a way that early and long-term members will greatly benefit from having staked their tokens longer. Also, it will make the Stake AGE not too powerful, as it still needs to be beneficial to stake more EFX as well. Such a parameter is a great example of something that can be controlled by DAO governance voting proposals.",{"type":30,"tag":55,"props":110,"children":112},{"alt":7,"src":111},"https://miro.medium.com/v2/resize:fit:720/format:webp/0*cnSX-wam1SSSoVa2",[],{"type":30,"tag":38,"props":114,"children":115},{},[116],{"type":36,"value":117},"Stake AGE has several benefits over regular staking:",{"type":30,"tag":38,"props":119,"children":120},{},[121],{"type":36,"value":122},"Users will be incentivized to keep their tokens staked for a longer time.\nEarly and long-term participants are rewarded.\nIt will be harder for new members with a lot of tokens to immediately take big rewards or votes from the DAO.\nThe penalty for unstaking will be bigger as users will lose their Stake AGE for their unstaked tokens, making sure users are incentivized to keep their tokens staked.",{"type":30,"tag":31,"props":124,"children":126},{"id":125},"voting-allocations-and-fee-rewards",[127],{"type":36,"value":128},"Voting Allocations and Fee Rewards",{"type":30,"tag":38,"props":130,"children":131},{},[132],{"type":36,"value":133},"There are four major stages that play an important role in the Effect DAO. The first one is the Staking Protocol, which will determine your DAO Rank. The next stage is to become a DAO Guardian with your DAO Rank by signing the DAO Constitution and participating in the Network. More on DAO Guardians can be found in this blog post. As a DAO Guardian, you can use your DAO Rank to write proposals and cast votes. By participating in the DAO, you’ll earn stakes in the network fee distribution pool which is the last stage of the Effect DAO.",{"type":30,"tag":55,"props":135,"children":137},{"alt":7,"src":136},"https://miro.medium.com/v2/resize:fit:720/format:webp/1*rw_jP8fvKGDm7Mrzeu4u4A.png",[],{"type":30,"tag":38,"props":139,"children":140},{},[141],{"type":36,"value":142},"The number of votes that a Guardian has is determined by the Effect Staking Protocol: a Triforce of EFX and its Stake Age, and more importantly, NFX. These three factors determine your DAO Rank and how many voting allocations you have at your disposal. Participating in either voting or proposing is highly rewarded with fee distributions, which will be discussed in a forthcoming chapter. Tied Voting Allocations will also play a special role in the fee distribution later on. You can read more about the Effect DAO Voting system in this blog post.",{"type":30,"tag":31,"props":144,"children":146},{"id":145},"migration-from-10-to-20",[147],{"type":36,"value":148},"Migration from 1.0 to 2.0",{"type":30,"tag":38,"props":150,"children":151},{},[152],{"type":36,"value":153},"The EFX that you currently have staked combined with your Stake AGE will be carried over to the Staking Protocol 2.0, so there is no reason for unstaking. In addition to the NFX bonus that early adopters have already generated by Staking Protocol 1.0 received, this carryover of Stake AGE is another valuable benefit for early and long-term stakers. Important to note that the generation of NFX will stop at the deployment of Effect Staking Protocol 2.0.",{"type":30,"tag":31,"props":155,"children":157},{"id":156},"more-details-technical-paper",[158],{"type":36,"value":159},"More details: Technical Paper",{"type":30,"tag":38,"props":161,"children":162},{},[163,165,173],{"type":36,"value":164},"While this blog post outlines the high-level inner workings of the new Staking Protocol 2.0, the exact implementation, parameters, and details can be found in the ",{"type":30,"tag":166,"props":167,"children":170},"a",{"href":168,"target":169},"/download/effect_staking_protocol.pdf","_blank",[171],{"type":36,"value":172},"Technical Paper",{"type":36,"value":174}," about the Effect Staking Protocol. This paper covers the mathematical formulas, among other things, for EFX Power with limited Stake AGE, the DAO level requirement formulas, dilution of the Stake AGE when topping up your stake, voting allocations, and more.",{"type":30,"tag":38,"props":176,"children":177},{},[178],{"type":36,"value":179},"Thanks for reading!",{"title":7,"searchDepth":181,"depth":181,"links":182},2,[183,184,185,186,187,188,189],{"id":33,"depth":181,"text":8},{"id":45,"depth":181,"text":48},{"id":70,"depth":181,"text":73},{"id":90,"depth":181,"text":93},{"id":125,"depth":181,"text":128},{"id":145,"depth":181,"text":148},{"id":156,"depth":181,"text":159},"markdown","content:news:effect-dao-staking-procotol.md","content","news/effect-dao-staking-procotol.md","md",1710751588668]